character_builds = {
    "フリーナ": {
        "element": "水",
        "weapon": "片手剣",
        "role": "サブアタッカー",
        "builds": {
            "汎用": {
                "fixed_mainstats": {
                    "花": "HP",
                    "羽": "攻撃力"
                },
                "mainstat_options": {
                    "時計": ["HP%", "元素チャージ効率"],
                    "杯": ["HP%", "水ダメージ"],
                    "冠": ["会心率", "会心ダメージ"]
                },
                "elixir_fixed_substats": {
                    "花": ["会心率", "会心ダメージ"],
                    "羽": ["会心率", "会心ダメージ"],
                    "時計": ["会心率", "会心ダメージ"],
                    "杯": ["会心率", "会心ダメージ"],
                    "冠": ["会心率", "HP%"]
                },
                "score_weight_options": {
                    "HP型": {
                        "会心率": 2.0,
                        "会心ダメージ": 1.0,
                        "HP%": 1.0,
                        "元素チャージ効率": 0.0
                    },
                    "チャージ型": {
                        "会心率": 2.0,
                        "会心ダメージ": 1.0,
                        "HP%": 0.0,
                        "元素チャージ効率": 1.0
                    }
                },
                "default_target_score": 180
            }
        }
    }
}